{
  "basic": {
    "loading": "Loading",
    "welcome": "Welcome",
    "welcomeBack": "Welcome Back",
    "language": "Language",
    "client": "Client",
    "history": "History",
    "signIn": "Sign In",
    "signOut": "Sign Out",
    "signUp": "Sign Up",
    "mainPage": "Main Page",
    "email": "Email",
    "password": "Password",
    "repo": "Repo"
  },
  "client": {
    "status": "Status",
    "response": "Response",
    "method": "Method",
    "endpointURL": "Endpoint URL",
    "plainText": "Plain Text",
    "key": "Key",
    "value": "Value",
    "send": "Send",
    "welcome": "Enter the URL and click Send to get a response",
    "headers": "Headers",
    "body": "Body",
    "variables": "Variables",
    "addHeader": "Add Header"
  },
  "welcome": {
    "ourDevs": "Our Team",
    "project": "Project",
    "rollingScopes": "Rolling Scopes School",
    "teamDescription": "We are a team of developers who have created an application that combines the power of Postman and GraphQL in a lightweight and convenient form. Our goal is to make working with APIs even more efficient!",
    "projectDescription": "Our application, developed on React and Next.js, provides a convenient interface for working with RESTful and GraphQL queries. It includes a query editor with formatting and base64 encoding of the query body, a response section with HTTP status information, method selection, a URL input field, variable and header sections. The GraphiQL client also has documentation displayed upon a successful SDL query. The query history allows you to restore previously executed queries and displays an information message when there are no queries. Registration is carried out using Firebase. There is support for two languages: Russian and English.",
    "RSSchoolDescription": "The project was created as part of the Rolling Scopes training course. RS School offers a unique learning experience as a free, community-based online education initiative. The RS School has been run by the Rolling Scopes community since 2013."
  },
  "login": {
    "login": "Login",
    "emailPlaceholder": "Enter your email",
    "passwordPlaceholder": "Enter your password",
    "createAccount": "Create Account"
  },
  "errors": {
    "email": "Invalid email address. Please enter a valid email.",
    "passwordLength": "Password must be at least 8 characters long.",
    "passwordLetter": "Password must contain at least one letter.",
    "passwordDigit": "Password must contain at least one digit.",
    "passwordSpecial": "Password must contain at least one special character.",
    "accountNotFound": "Your account is not found =("
  }
}

